{
  "_name_or_path": "openbmb/MiniCPM-2B-dpo-fp16",
  "architectures": [
    "MiniCPMForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "openbmb/MiniCPM-2B-dpo-fp16--configuration_minicpm.MiniCPMConfig",
    "AutoModel": "openbmb/MiniCPM-2B-dpo-fp16--modeling_minicpm.MiniCPMModel",
    "AutoModelForCausalLM": "openbmb/MiniCPM-2B-dpo-fp16--modeling_minicpm.MiniCPMForCausalLM",
    "AutoModelForSeq2SeqLM": "openbmb/MiniCPM-2B-dpo-fp16--modeling_minicpm.MiniCPMForCausalLM",
    "AutoModelForSequenceClassification": "openbmb/MiniCPM-2B-dpo-fp16--modeling_minicpm.MiniCPMForSequenceClassification"
  },
  "bos_token_id": 1,
  "dim_model_base": 256,
  "eos_token_id": 2,
  "hidden_act": "silu",
  "hidden_size": 2304,
  "initializer_range": 0.1,
  "intermediate_size": 5760,
  "max_position_embeddings": 4096,
  "model_type": "minicpm",
  "num_attention_heads": 36,
  "num_hidden_layers": 40,
  "num_key_value_heads": 36,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "scale_depth": 1.4,
  "scale_emb": 12,
  "transformers_version": "4.45.0.dev0",
  "use_cache": true,
  "vocab_size": 122753
}
