<?xml version="1.0"?>
<net name="Model3" version="11">
	<layers>
		<layer id="0" name="hidden_states" type="Parameter" version="opset1">
			<data shape="?,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="hidden_states">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_1793" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="0" size="40" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="8">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="14,9,hidden_states">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="self.proj.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 3, 2, 14, 14" offset="40" size="3010560" />
			<output>
				<port id="0" precision="FP16" names="self.proj.weight">
					<dim>1280</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="self.proj.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="__module.proj/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="2, 14, 14" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="32">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_1840" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="3010600" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="18">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Result_1842" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1" />
		<edge from-layer="2" from-port="2" to-layer="5" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="5" to-port="1" />
		<edge from-layer="5" from-port="2" to-layer="7" to-port="0" />
		<edge from-layer="6" from-port="0" to-layer="7" to-port="1" />
		<edge from-layer="7" from-port="2" to-layer="8" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2024.4.0-16579-c3152d32c9c-releases/2024/4" />
		<conversion_parameters>
			<framework value="pytorch" />
			<is_python_object value="True" />
		</conversion_parameters>
	</rt_info>
</net>
