<?xml version="1.0"?>
<net name="Model6" version="11">
	<layers>
		<layer id="2" name="hidden_states" type="Parameter" version="opset1">
			<data shape="?,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="hidden_states">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="attention_mask" type="Parameter" version="opset1">
			<data shape="?,?,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="rotary_pos_emb" type="Parameter" version="opset1">
			<data shape="?,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="rotary_pos_emb">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="__module.blocks.0.norm1/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="0" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="__module.blocks.0.norm1/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999999747524271e-07" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_106482" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1280" offset="4" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="__module.blocks.0.norm1/aten::layer_norm/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_106483" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1280" offset="5124" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="__module.blocks.0.norm1/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="125,hidden_states.3">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="self.blocks.0.attn.qkv.weight" type="Const" version="opset1">
			<data element_type="u4" shape="3840, 10, 128" offset="10244" size="2457600" />
			<output>
				<port id="0" precision="U4">
					<dim>3840</dim>
					<dim>10</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Convert_116160" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U4">
					<dim>3840</dim>
					<dim>10</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>3840</dim>
					<dim>10</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="self.blocks.0.attn.qkv.weight/zero_point" type="Const" version="opset1">
			<data element_type="u4" shape="3840, 10, 1" offset="2467844" size="19200" />
			<output>
				<port id="0" precision="U4">
					<dim>3840</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Convert_116162" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U4">
					<dim>3840</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>3840</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="self.blocks.0.attn.qkv.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>3840</dim>
					<dim>10</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>3840</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>3840</dim>
					<dim>10</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="self.blocks.0.attn.qkv.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="3840, 10, 1" offset="2487044" size="76800" />
			<output>
				<port id="0" precision="FP16">
					<dim>3840</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="self.blocks.0.attn.qkv.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>3840</dim>
					<dim>10</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>3840</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>3840</dim>
					<dim>10</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_116167" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="2563844" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Reshape_116168" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP16">
					<dim>3840</dim>
					<dim>10</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>3840</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="self.blocks.0.attn.qkv.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>3840</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>3840</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="__module.blocks.0.attn.qkv/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3840</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3840</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_106484" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3840" offset="2563860" size="15360" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3840</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="__module.blocks.0.attn.qkv/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3840</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3840</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="131">
					<dim>-1</dim>
					<dim>3840</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_110297" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2579220" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="__module.blocks.0.attn/aten::reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3840</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="133">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_3751" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2579252" size="32" />
			<output>
				<port id="0" precision="I64" names="134">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="__module.blocks.0.attn/aten::permute/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="135">
					<dim>3</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="103" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2579284" size="8" />
			<output>
				<port id="0" precision="I64" names="103" />
			</output>
		</layer>
		<layer id="27" name="__module.blocks.0.attn/prim::ListUnpack/Split" type="Split" version="opset1">
			<data num_splits="3" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="__module.blocks.0.attn/prim::ListUnpack/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="137,q.1">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="__module.blocks.0.attn/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="140,141,tensor.1,tensor.3">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="__module.blocks.0.attn/aten::cos/Cos" type="Cos" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="1052,1084,1182,1214,1312,1344,142,1442,1474,1572,1604,1702,1734,174,1832,1864,1962,1994,2092,2124,2222,2254,2352,2384,2482,2514,2612,2644,272,2742,2774,2872,2904,3002,3034,304,3132,3164,3262,3294,3392,3424,3522,3554,3652,3684,3782,3814,3912,3944,402,4042,4074,4172,4204,434,532,564,662,694,792,824,922,954,cos.1,cos.101,cos.105,cos.109,cos.113,cos.117,cos.121,cos.125,cos.129,cos.13,cos.133,cos.137,cos.141,cos.145,cos.149,cos.153,cos.157,cos.161,cos.165,cos.169,cos.17,cos.173,cos.177,cos.181,cos.185,cos.189,cos.193,cos.197,cos.201,cos.205,cos.209,cos.21,cos.213,cos.217,cos.221,cos.225,cos.229,cos.233,cos.237,cos.241,cos.245,cos.249,cos.25,cos.253,cos.29,cos.33,cos.37,cos.41,cos.45,cos.49,cos.5,cos.53,cos.57,cos.61,cos.65,cos.69,cos.73,cos.77,cos.81,cos.85,cos.89,cos.9,cos.93,cos.97">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="107" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2579292" size="8" />
			<output>
				<port id="0" precision="I64" names="107" />
			</output>
		</layer>
		<layer id="32" name="__module.blocks.0.attn/aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="1054,1086,1184,1216,1314,1346,144,1444,1476,1574,1606,1704,1736,176,1834,1866,1964,1996,2094,2126,2224,2256,2354,2386,2484,2516,2614,2646,274,2744,2776,2874,2906,3004,3036,306,3134,3166,3264,3296,3394,3426,3524,3556,3654,3686,3784,3816,3914,3946,404,4044,4076,4174,4206,436,534,566,664,696,794,826,924,956">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_3777" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="2579300" size="24" />
			<output>
				<port id="0" precision="I64" names="145">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.blocks.0.attn/aten::repeat/Tile" type="Tile" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1056,1088,1186,1218,1316,1348,1446,146,1478,1576,1608,1706,1738,178,1836,1868,1966,1998,2096,2128,2226,2258,2356,2388,2486,2518,2616,2648,2746,276,2778,2876,2908,3006,3038,308,3136,3168,3266,3298,3396,3428,3526,3558,3656,3688,3786,3818,3916,3948,4046,406,4078,4176,4208,438,536,568,666,698,796,828,926,958">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="__module.blocks.0.attn/aten::unsqueeze/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="1057,1058,1089,1090,1187,1188,1219,1220,1317,1318,1349,1350,1447,1448,147,1479,148,1480,1577,1578,1609,1610,1707,1708,1739,1740,179,180,1837,1838,1869,1870,1967,1968,1999,2000,2097,2098,2129,2130,2227,2228,2259,2260,2357,2358,2389,2390,2487,2488,2519,2520,2617,2618,2649,2650,2747,2748,277,2779,278,2780,2877,2878,2909,2910,3007,3008,3039,3040,309,310,3137,3138,3169,3170,3267,3268,3299,3300,3397,3398,3429,3430,3527,3528,3559,3560,3657,3658,3689,3690,3787,3788,3819,3820,3917,3918,3949,3950,4047,4048,407,4079,408,4080,4177,4178,4209,4210,439,440,537,538,569,570,667,668,699,700,797,798,829,830,927,928,959,960,cos,cos.103,cos.107,cos.11,cos.111,cos.115,cos.119,cos.123,cos.127,cos.131,cos.135,cos.139,cos.143,cos.147,cos.15,cos.151,cos.155,cos.159,cos.163,cos.167,cos.171,cos.175,cos.179,cos.183,cos.187,cos.19,cos.191,cos.195,cos.199,cos.203,cos.207,cos.211,cos.215,cos.219,cos.223,cos.227,cos.23,cos.231,cos.235,cos.239,cos.243,cos.247,cos.251,cos.27,cos.3,cos.31,cos.35,cos.39,cos.43,cos.47,cos.51,cos.55,cos.59,cos.63,cos.67,cos.7,cos.71,cos.75,cos.79,cos.83,cos.87,cos.91,cos.95,cos.99">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="__module.blocks.0.attn/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="154">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="__module.blocks.0.attn/aten::size/ShapeOf_2" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="104" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2579324" size="8" />
			<output>
				<port id="0" precision="I64" names="104" />
			</output>
		</layer>
		<layer id="39" name="__module.blocks.0.attn/aten::size/Constant_2" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2579332" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="40" name="__module.blocks.0.attn/aten::size/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="155,160" />
			</output>
		</layer>
		<layer id="41" name="Constant_3700" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2579336" size="8" />
			<output>
				<port id="0" precision="I64" names="112" />
			</output>
		</layer>
		<layer id="42" name="__module.blocks.0.attn/aten::floor_divide/Divide_1" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" />
			</output>
		</layer>
		<layer id="43" name="__module.blocks.0.attn/aten::floor_divide/Floor_1" type="Floor" version="opset1">
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="157,158,162,163" />
			</output>
		</layer>
		<layer id="44" name="Constant_75587" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2579344" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="__module.blocks.0.attn/aten::slice/Reshape_5" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="__module.blocks.0.attn/aten::slice/Reshape_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2579352" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="__module.blocks.0.attn/aten::slice/Reshape_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2579292" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="__module.blocks.0.attn/aten::slice/Reshape_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2579324" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="__module.blocks.0.attn/aten::slice/Slice" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="164,x2.1">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_106485" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2579360" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="__module.blocks.0.attn/aten::neg/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="165">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="__module.blocks.0.attn/aten::slice/Reshape_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2579284" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="__module.blocks.0.attn/aten::slice/Reshape_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2579292" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="__module.blocks.0.attn/aten::slice/Reshape_7" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2579324" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="__module.blocks.0.attn/aten::slice/Slice_1" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="159">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="__module.blocks.0.attn/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="167">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="__module.blocks.0.attn/aten::sin/Sin" type="Sin" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="1053,1085,1183,1215,1313,1345,143,1443,1475,1573,1605,1703,1735,175,1833,1865,1963,1995,2093,2125,2223,2255,2353,2385,2483,2515,2613,2645,273,2743,2775,2873,2905,3003,3035,305,3133,3165,3263,3295,3393,3425,3523,3555,3653,3685,3783,3815,3913,3945,403,4043,4075,4173,4205,435,533,565,663,695,793,825,923,955,sin.1,sin.101,sin.105,sin.109,sin.113,sin.117,sin.121,sin.125,sin.129,sin.13,sin.133,sin.137,sin.141,sin.145,sin.149,sin.153,sin.157,sin.161,sin.165,sin.169,sin.17,sin.173,sin.177,sin.181,sin.185,sin.189,sin.193,sin.197,sin.201,sin.205,sin.209,sin.21,sin.213,sin.217,sin.221,sin.225,sin.229,sin.233,sin.237,sin.241,sin.245,sin.249,sin.25,sin.253,sin.29,sin.33,sin.37,sin.41,sin.45,sin.49,sin.5,sin.53,sin.57,sin.61,sin.65,sin.69,sin.73,sin.77,sin.81,sin.85,sin.89,sin.9,sin.93,sin.97">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="__module.blocks.0.attn/aten::unsqueeze/Unsqueeze_3" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="1059,1091,1189,1221,1319,1351,1449,1481,149,1579,1611,1709,1741,181,1839,1871,1969,2001,2099,2131,2229,2261,2359,2391,2489,2521,2619,2651,2749,2781,279,2879,2911,3009,3041,311,3139,3171,3269,3301,3399,3431,3529,3561,3659,3691,3789,3821,3919,3951,4049,4081,409,4179,4211,441,539,571,669,701,799,831,929,961">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_3787" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="2579300" size="24" />
			<output>
				<port id="0" precision="I64" names="150">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="__module.blocks.0.attn/aten::repeat/Tile_1" type="Tile" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1061,1093,1191,1223,1321,1353,1451,1483,151,1581,1613,1711,1743,183,1841,1873,1971,2003,2101,2133,2231,2263,2361,2393,2491,2523,2621,2653,2751,2783,281,2881,2913,3011,3043,313,3141,3173,3271,3303,3401,3433,3531,3563,3661,3693,3791,3823,3921,3953,4051,4083,411,4181,4213,443,541,573,671,703,801,833,931,963">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="__module.blocks.0.attn/aten::unsqueeze/Unsqueeze_4" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="1062,1063,1094,1095,1192,1193,1224,1225,1322,1323,1354,1355,1452,1453,1484,1485,152,153,1582,1583,1614,1615,1712,1713,1744,1745,184,1842,1843,185,1874,1875,1972,1973,2004,2005,2102,2103,2134,2135,2232,2233,2264,2265,2362,2363,2394,2395,2492,2493,2524,2525,2622,2623,2654,2655,2752,2753,2784,2785,282,283,2882,2883,2914,2915,3012,3013,3044,3045,314,3142,3143,315,3174,3175,3272,3273,3304,3305,3402,3403,3434,3435,3532,3533,3564,3565,3662,3663,3694,3695,3792,3793,3824,3825,3922,3923,3954,3955,4052,4053,4084,4085,412,413,4182,4183,4214,4215,444,445,542,543,574,575,672,673,704,705,802,803,834,835,932,933,964,965,sin,sin.103,sin.107,sin.11,sin.111,sin.115,sin.119,sin.123,sin.127,sin.131,sin.135,sin.139,sin.143,sin.147,sin.15,sin.151,sin.155,sin.159,sin.163,sin.167,sin.171,sin.175,sin.179,sin.183,sin.187,sin.19,sin.191,sin.195,sin.199,sin.203,sin.207,sin.211,sin.215,sin.219,sin.223,sin.227,sin.23,sin.231,sin.235,sin.239,sin.243,sin.247,sin.251,sin.27,sin.3,sin.31,sin.35,sin.39,sin.43,sin.47,sin.51,sin.55,sin.59,sin.63,sin.67,sin.7,sin.71,sin.75,sin.79,sin.83,sin.87,sin.91,sin.95,sin.99">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.blocks.0.attn/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="168">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="__module.blocks.0.attn/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="169,170,output.1">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="__module.blocks.0.attn/aten::squeeze/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="171,q.3">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="__module.blocks.0.attn/aten::transpose/ScatterElementsUpdate" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="2579364" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="__module.blocks.0.attn/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="204">
					<dim>16</dim>
					<dim>-1</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="__module.blocks.0.attn/prim::ListUnpack/Squeeze_0" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="138,k.1">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="__module.blocks.0.attn/aten::unsqueeze/Unsqueeze_5" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="172,173,tensor.5,tensor.7">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="__module.blocks.0.attn/aten::mul/Multiply_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="186">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="__module.blocks.0.attn/aten::size/ShapeOf_4" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="__module.blocks.0.attn/aten::size/Constant_4" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2579332" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="72" name="__module.blocks.0.attn/aten::size/Gather_4" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="187,192" />
			</output>
		</layer>
		<layer id="73" name="__module.blocks.0.attn/aten::floor_divide/Divide_3" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" />
			</output>
		</layer>
		<layer id="74" name="__module.blocks.0.attn/aten::floor_divide/Floor_3" type="Floor" version="opset1">
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="189,190,194,195" />
			</output>
		</layer>
		<layer id="75" name="Constant_75588" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2579344" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.blocks.0.attn/aten::slice/Reshape_13" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="__module.blocks.0.attn/aten::slice/Reshape_9" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2579352" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="__module.blocks.0.attn/aten::slice/Reshape_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2579292" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="__module.blocks.0.attn/aten::slice/Reshape_11" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2579324" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="__module.blocks.0.attn/aten::slice/Slice_2" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="196,x2.3">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_106486" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2579360" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="__module.blocks.0.attn/aten::neg/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="197">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="__module.blocks.0.attn/aten::slice/Reshape_12" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2579284" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="__module.blocks.0.attn/aten::slice/Reshape_14" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2579292" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="__module.blocks.0.attn/aten::slice/Reshape_15" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2579324" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="__module.blocks.0.attn/aten::slice/Slice_3" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="191">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="__module.blocks.0.attn/aten::cat/Concat_1" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="199">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="__module.blocks.0.attn/aten::mul/Multiply_3" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="200">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="__module.blocks.0.attn/aten::add/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="201,202,output.3">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="__module.blocks.0.attn/aten::squeeze/Squeeze_1" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="203,k.3">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="__module.blocks.0.attn/aten::transpose/ScatterElementsUpdate_1" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="2579364" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="__module.blocks.0.attn/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="205">
					<dim>16</dim>
					<dim>-1</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="__module.blocks.0.attn/prim::ListUnpack/Squeeze_1" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="139,v.1">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="__module.blocks.0.attn/aten::transpose/ScatterElementsUpdate_2" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="2579364" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="__module.blocks.0.attn/aten::transpose/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="206">
					<dim>16</dim>
					<dim>-1</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="__module.blocks.0.attn/aten::scaled_dot_product_attention/ScaledDotProductAttention" type="ScaledDotProductAttention" version="opset13">
			<data causal="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>-1</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>-1</dim>
					<dim>80</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>16</dim>
					<dim>-1</dim>
					<dim>80</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="207,attn_output.1">
					<dim>16</dim>
					<dim>-1</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="__module.blocks.0.attn/aten::transpose/ScatterElementsUpdate_3" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="2579364" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="__module.blocks.0.attn/aten::transpose/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>-1</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="208,attn_output.3">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Concat_80854" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="2579376" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="__module.blocks.0.attn/aten::reshape/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="210">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="self.blocks.0.attn.proj.weight" type="Const" version="opset1">
			<data element_type="u4" shape="1280, 10, 128" offset="2579392" size="819200" />
			<output>
				<port id="0" precision="U4">
					<dim>1280</dim>
					<dim>10</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Convert_116512" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U4">
					<dim>1280</dim>
					<dim>10</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>10</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="self.blocks.0.attn.proj.weight/zero_point" type="Const" version="opset1">
			<data element_type="u4" shape="1280, 10, 1" offset="3398592" size="6400" />
			<output>
				<port id="0" precision="U4">
					<dim>1280</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Convert_116514" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U4">
					<dim>1280</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="self.blocks.0.attn.proj.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>10</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>10</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="self.blocks.0.attn.proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 10, 1" offset="3404992" size="25600" />
			<output>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="self.blocks.0.attn.proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>10</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>10</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Constant_116519" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="3430592" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Reshape_116520" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>10</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="self.blocks.0.attn.proj.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="__module.blocks.0.attn.proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_106487" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1280" offset="3430608" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="__module.blocks.0.attn.proj/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="213">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="__module.blocks.0/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="214,hidden_states.5">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="__module.blocks.0.norm2/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="0" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="__module.blocks.0.norm2/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999999747524271e-07" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
