<?xml version="1.0"?>
<net name="tokenizer" version="11">
	<layers>
		<layer id="0" name="Parameter_5865" type="Parameter" version="opset1">
			<data shape="?" element_type="string" />
			<output>
				<port id="0" precision="STRING" names="Parameter_5865">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_5961" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="2" name="Constant_5962" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="3" name="Constant_5963" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="8" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_5876" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="5" name="StringTensorUnpack_5866" type="StringTensorUnpack" version="extension">
			<data mode="begins_ends" />
			<input>
				<port id="0" precision="STRING">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_5868" type="Const" version="opset1">
			<data element_type="u8" shape="39" offset="12" size="39" />
			<output>
				<port id="0" precision="U8">
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_5870" type="Const" version="opset1">
			<data element_type="u8" shape="0" offset="51" size="1" />
			<output>
				<port id="0" precision="U8">
					<dim>0</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="RegexNormalization_5871" type="RegexNormalization" version="extension">
			<data global_replace="true" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>39</dim>
				</port>
				<port id="4" precision="U8">
					<dim>0</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="ShapeOf_5872" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_5873" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="11" name="Constant_5874" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="12" name="Gather_5875" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" />
			</output>
		</layer>
		<layer id="13" name="Constant_5877" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="14" name="Range_5878" type="Range" version="opset4">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_5880" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="16" name="Constant_5881" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="52" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="17" name="Add_5882" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" />
			</output>
		</layer>
		<layer id="18" name="Constant_5883" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="19" name="Range_5884" type="Range" version="opset4">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_5947" type="Const" version="opset1">
			<data element_type="u8" shape="3" offset="60" size="3" />
			<output>
				<port id="0" precision="U8">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="RegexSplit_5948" type="RegexSplit" version="extension">
			<data behaviour="remove" invert="false" max_splits="-1" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="U8">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_5950" type="Const" version="opset1">
			<data element_type="u8" shape="202" offset="63" size="202" />
			<output>
				<port id="0" precision="U8">
					<dim>202</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="RegexSplit_5951" type="RegexSplit" version="extension">
			<data behaviour="isolate" invert="false" max_splits="-1" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="U8">
					<dim>202</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_5953" type="Const" version="opset1">
			<data element_type="u8" shape="172932" offset="265" size="172932" />
			<output>
				<port id="0" precision="U8">
					<dim>172932</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StringTensorUnpack_5954" type="StringTensorUnpack" version="extension">
			<data mode="begins_ends" />
			<input>
				<port id="0" precision="U8">
					<dim>172932</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_5955" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="173197" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="27" name="WordpieceTokenizer_5956" type="WordpieceTokenizer" version="extension">
			<data suffix_indicator="##" max_bytes_per_word="100" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32" />
			</input>
			<output>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="11" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Subtract_5957" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_5958" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="173201" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="30" name="Minimum_5959" type="Minimum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Add_5960" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_5964" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="33" name="Constant_5965" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="34" name="Constant_5966" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="173205" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_5967" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="173209" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="CombineSegments_5968" type="CombineSegments" version="extension">
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="I32" />
				<port id="7" precision="I32" />
				<port id="8" precision="I32">
					<dim>1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="10" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="11" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="12" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="13" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="14" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="15" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Subtract_5969" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_5970" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="39" name="ReduceMax_5971" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" />
			</output>
		</layer>
		<layer id="40" name="Constant_5972" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="41" name="RaggedToDense_5973" type="RaggedToDense" version="extension">
			<data pad_right="true" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32" />
				<port id="4" precision="I32" />
			</input>
			<output>
				<port id="5" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="6" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Convert_5974" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Convert_5974" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_5975" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="46" name="RaggedToDense_5976" type="RaggedToDense" version="extension">
			<data pad_right="true" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32" />
				<port id="4" precision="I32" />
			</input>
			<output>
				<port id="5" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="6" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="RaggedToDense_5976.0" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="token_type_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="RaggedToDense_5973.0" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Result_5977" type="Result" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
		</layer>
		<layer id="48" name="Result_5978" type="Result" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
		</layer>
		<layer id="44" name="Result_5979" type="Result" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="5" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="36" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="36" to-port="1" />
		<edge from-layer="3" from-port="0" to-layer="36" to-port="2" />
		<edge from-layer="4" from-port="0" to-layer="14" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="8" to-port="0" />
		<edge from-layer="5" from-port="2" to-layer="8" to-port="1" />
		<edge from-layer="5" from-port="3" to-layer="8" to-port="2" />
		<edge from-layer="6" from-port="0" to-layer="8" to-port="3" />
		<edge from-layer="7" from-port="0" to-layer="8" to-port="4" />
		<edge from-layer="8" from-port="5" to-layer="9" to-port="0" />
		<edge from-layer="8" from-port="5" to-layer="21" to-port="2" />
		<edge from-layer="8" from-port="6" to-layer="21" to-port="3" />
		<edge from-layer="8" from-port="7" to-layer="21" to-port="4" />
		<edge from-layer="9" from-port="1" to-layer="12" to-port="0" />
		<edge from-layer="10" from-port="0" to-layer="12" to-port="1" />
		<edge from-layer="11" from-port="0" to-layer="12" to-port="2" />
		<edge from-layer="12" from-port="3" to-layer="14" to-port="1" />
		<edge from-layer="12" from-port="3" to-layer="17" to-port="0" />
		<edge from-layer="13" from-port="0" to-layer="14" to-port="2" />
		<edge from-layer="14" from-port="3" to-layer="21" to-port="0" />
		<edge from-layer="15" from-port="0" to-layer="19" to-port="0" />
		<edge from-layer="16" from-port="0" to-layer="17" to-port="1" />
		<edge from-layer="17" from-port="2" to-layer="19" to-port="1" />
		<edge from-layer="18" from-port="0" to-layer="19" to-port="2" />
		<edge from-layer="19" from-port="3" to-layer="21" to-port="1" />
		<edge from-layer="20" from-port="0" to-layer="21" to-port="5" />
		<edge from-layer="21" from-port="6" to-layer="23" to-port="0" />
		<edge from-layer="21" from-port="7" to-layer="23" to-port="1" />
		<edge from-layer="21" from-port="8" to-layer="23" to-port="2" />
		<edge from-layer="21" from-port="9" to-layer="23" to-port="3" />
		<edge from-layer="21" from-port="10" to-layer="23" to-port="4" />
		<edge from-layer="22" from-port="0" to-layer="23" to-port="5" />
		<edge from-layer="23" from-port="10" to-layer="27" to-port="4" />
		<edge from-layer="23" from-port="6" to-layer="27" to-port="0" />
		<edge from-layer="23" from-port="7" to-layer="27" to-port="1" />
		<edge from-layer="23" from-port="8" to-layer="27" to-port="2" />
		<edge from-layer="23" from-port="9" to-layer="27" to-port="3" />
		<edge from-layer="24" from-port="0" to-layer="25" to-port="0" />
		<edge from-layer="25" from-port="2" to-layer="27" to-port="6" />
		<edge from-layer="25" from-port="3" to-layer="27" to-port="7" />
		<edge from-layer="25" from-port="1" to-layer="27" to-port="5" />
		<edge from-layer="26" from-port="0" to-layer="27" to-port="8" />
		<edge from-layer="27" from-port="10" to-layer="28" to-port="0" />
		<edge from-layer="27" from-port="9" to-layer="28" to-port="1" />
		<edge from-layer="27" from-port="9" to-layer="31" to-port="0" />
		<edge from-layer="27" from-port="9" to-layer="36" to-port="3" />
		<edge from-layer="27" from-port="11" to-layer="36" to-port="5" />
		<edge from-layer="28" from-port="2" to-layer="30" to-port="0" />
		<edge from-layer="29" from-port="0" to-layer="30" to-port="1" />
		<edge from-layer="30" from-port="2" to-layer="31" to-port="1" />
		<edge from-layer="31" from-port="2" to-layer="36" to-port="4" />
		<edge from-layer="32" from-port="0" to-layer="36" to-port="6" />
		<edge from-layer="33" from-port="0" to-layer="36" to-port="7" />
		<edge from-layer="34" from-port="0" to-layer="36" to-port="8" />
		<edge from-layer="35" from-port="0" to-layer="36" to-port="9" />
		<edge from-layer="36" from-port="11" to-layer="37" to-port="0" />
		<edge from-layer="36" from-port="10" to-layer="37" to-port="1" />
		<edge from-layer="36" from-port="10" to-layer="41" to-port="0" />
		<edge from-layer="36" from-port="11" to-layer="41" to-port="1" />
		<edge from-layer="36" from-port="12" to-layer="41" to-port="2" />
		<edge from-layer="36" from-port="13" to-layer="46" to-port="0" />
		<edge from-layer="36" from-port="14" to-layer="46" to-port="1" />
		<edge from-layer="36" from-port="15" to-layer="46" to-port="2" />
		<edge from-layer="37" from-port="2" to-layer="39" to-port="0" />
		<edge from-layer="38" from-port="0" to-layer="39" to-port="1" />
		<edge from-layer="39" from-port="2" to-layer="41" to-port="3" />
		<edge from-layer="39" from-port="2" to-layer="46" to-port="3" />
		<edge from-layer="40" from-port="0" to-layer="41" to-port="4" />
		<edge from-layer="41" from-port="6" to-layer="42" to-port="0" />
		<edge from-layer="41" from-port="5" to-layer="49" to-port="0" />
		<edge from-layer="42" from-port="1" to-layer="43" to-port="0" />
		<edge from-layer="43" from-port="1" to-layer="44" to-port="0" />
		<edge from-layer="45" from-port="0" to-layer="46" to-port="4" />
		<edge from-layer="46" from-port="5" to-layer="47" to-port="0" />
		<edge from-layer="47" from-port="1" to-layer="48" to-port="0" />
		<edge from-layer="49" from-port="1" to-layer="50" to-port="0" />
	</edges>
	<rt_info>
		<original_tokenizer_class value="&lt;class 'transformers.models.bert.tokenization_bert_fast.BertTokenizerFast'>" />
		<pad_token_id value="0" />
	</rt_info>
</net>
