<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="0" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="self.text_model.embeddings.token_embedding.weight_compressed" type="Const" version="opset1">
			<data element_type="u8" shape="49408, 768" offset="0" size="37945344" />
			<output>
				<port id="0" precision="U8">
					<dim>49408</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Convert_764716" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>49408</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>49408</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="self.text_model.embeddings.token_embedding.weight_compressed/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="49408, 1" offset="37945344" size="49408" />
			<output>
				<port id="0" precision="U8">
					<dim>49408</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Convert_764719" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>49408</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>49408</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="self.text_model.embeddings.token_embedding.weight_compressed/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>49408</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>49408</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>49408</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="self.text_model.embeddings.token_embedding.weight_compressed/scale" type="Const" version="opset1">
			<data element_type="f16" shape="49408, 1" offset="37994752" size="98816" />
			<output>
				<port id="0" precision="FP16">
					<dim>49408</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="self.text_model.embeddings.token_embedding.weight_compressed/fq_weights_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>49408</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>49408</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>49408</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="self.text_model.embeddings.token_embedding.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>49408</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>49408</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="__module.text_model/prim::ListConstruct/Reshape" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38093568" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="__module.text_model/aten::size/ShapeOf_3" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="27" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="38093576" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="27" />
			</output>
		</layer>
		<layer id="12" name="__module.text_model/aten::size/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="38093584" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="13" name="__module.text_model/aten::size/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="33,48,key_value_length" />
			</output>
		</layer>
		<layer id="14" name="Constant_35342" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38093568" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="__module.text_model/prim::ListConstruct/Reshape_0" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="__module.text_model/prim::ListConstruct/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="35">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="__module.text_model/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="1131,36,input_ids,input_ids.3">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="__module.text_model.embeddings.token_embedding/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="38093584" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="19" name="__module.text_model.embeddings.token_embedding/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>49408</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="44,inputs_embeds">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="self.text_model.embeddings.position_embedding.weight_compressed" type="Const" version="opset1">
			<data element_type="u8" shape="77, 768" offset="38093588" size="59136" />
			<output>
				<port id="0" precision="U8">
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Convert_764706" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="self.text_model.embeddings.position_embedding.weight_compressed/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="77, 1" offset="38152724" size="77" />
			<output>
				<port id="0" precision="U8">
					<dim>77</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Convert_764709" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>77</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>77</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="self.text_model.embeddings.position_embedding.weight_compressed/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>77</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>77</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="self.text_model.embeddings.position_embedding.weight_compressed/scale" type="Const" version="opset1">
			<data element_type="f16" shape="77, 1" offset="38152801" size="154" />
			<output>
				<port id="0" precision="FP16">
					<dim>77</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="self.text_model.embeddings.position_embedding.weight_compressed/fq_weights_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>77</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>77</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="self.text_model.embeddings.position_embedding.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>77</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="__module.text_model.embeddings/aten::slice/Slice" type="Const" version="opset1">
			<data element_type="i64" shape="1, 77" offset="38152955" size="616" />
			<output>
				<port id="0" precision="I64" names="41">
					<dim>1</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_54497" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="38153571" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_54498" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="38153571" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_54494" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38093576" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="__module.text_model.embeddings/aten::size/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_52585" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38093576" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.text_model.embeddings/aten::size/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="38093584" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="35" name="__module.text_model.embeddings/aten::size/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="40">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_54493" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="38093584" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="ScatterUpdate_54499" type="ScatterUpdate" version="opset3">
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_54502" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="38153587" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="__module.text_model.embeddings/aten::slice/Slice_1" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0" end_mask="1, 0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>77</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="42">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="__module.text_model.embeddings.position_embedding/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="__module.text_model.embeddings.position_embedding/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="38093584" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="42" name="__module.text_model.embeddings.position_embedding/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>77</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="46,position_embeddings">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="__module.text_model.embeddings/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="47,residual.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="__module.text_model.encoder.layers.0.layer_norm1/aten::layer_norm/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="38153603" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="__module.text_model.encoder.layers.0.layer_norm1/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_57368_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="38153607" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_57368" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="__module.text_model.encoder.layers.0.layer_norm1/aten::layer_norm/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_57369_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="38155143" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_57369" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="__module.text_model.encoder.layers.0.layer_norm1/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="100,hidden_states.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_57036_compressed" type="Const" version="opset1">
			<data element_type="u8" shape="768, 768" offset="38156679" size="589824" />
			<output>
				<port id="0" precision="U8">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Convert_764746" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_57036_compressed/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="768, 1" offset="38746503" size="768" />
			<output>
				<port id="0" precision="U8">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Convert_764749" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_57036_compressed/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_57036_compressed/scale" type="Const" version="opset1">
			<data element_type="f16" shape="768, 1" offset="38747271" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_57036_compressed/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_57036" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Multiply_56987" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_57370_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="38748807" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_57370" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="__module.text_model.encoder.layers.0.self_attn/aten::mul/Multiply" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="112,tensor.5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="__module.text_model.encoder.layers.0.self_attn/aten::size/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="28" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="38750343" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="28" />
			</output>
		</layer>
		<layer id="66" name="__module.text_model.encoder.layers.0.self_attn/aten::size/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="38093584" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="67" name="__module.text_model.encoder.layers.0.self_attn/aten::size/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="105" />
			</output>
		</layer>
		<layer id="68" name="Constant_35343" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38093568" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="__module.text_model.encoder.layers.0.self_attn/prim::ListConstruct/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_52588" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38093576" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="__module.text_model.encoder.layers.0.self_attn/aten::size/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="38093584" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="72" name="__module.text_model.encoder.layers.0.self_attn/aten::size/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="107">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="__module.text_model.encoder.layers.0.self_attn/prim::ListConstruct/Reshape_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38750351" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="__module.text_model.encoder.layers.0.self_attn/prim::ListConstruct/Reshape_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38750359" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.text_model.encoder.layers.0.self_attn/prim::ListConstruct/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="131">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.text_model.encoder.layers.0.self_attn/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="132">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="__module.text_model.encoder.layers.0.self_attn/aten::transpose/ScatterElementsUpdate" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="38750367" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="__module.text_model.encoder.layers.0.self_attn/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="133">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="38750351" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="11" />
			</output>
		</layer>
		<layer id="80" name="__module.text_model.encoder.layers.0.self_attn/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="127,128,129,130,147,148" />
			</output>
		</layer>
		<layer id="81" name="Constant_35347" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38093568" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="__module.text_model.encoder.layers.0.self_attn/prim::ListConstruct/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="__module.text_model.encoder.layers.0.self_attn/prim::ListConstruct/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="135,137,139">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="__module.text_model.encoder.layers.0.self_attn/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="136">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="self.text_model.encoder.layers.0.self_attn.k_proj.weight_compressed" type="Const" version="opset1">
			<data element_type="u8" shape="768, 768" offset="38750383" size="589824" />
			<output>
				<port id="0" precision="U8">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Convert_764736" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="self.text_model.encoder.layers.0.self_attn.k_proj.weight_compressed/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="768, 1" offset="39340207" size="768" />
			<output>
				<port id="0" precision="U8">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Convert_764739" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="self.text_model.encoder.layers.0.self_attn.k_proj.weight_compressed/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="self.text_model.encoder.layers.0.self_attn.k_proj.weight_compressed/scale" type="Const" version="opset1">
			<data element_type="f16" shape="768, 1" offset="39340975" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="self.text_model.encoder.layers.0.self_attn.k_proj.weight_compressed/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="self.text_model.encoder.layers.0.self_attn.k_proj.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="__module.text_model.encoder.layers.0.self_attn.k_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_57371_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="39342511" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_57371" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="__module.text_model.encoder.layers.0.self_attn.k_proj/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="115,tensor.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="__module.text_model.encoder.layers.0.self_attn/prim::ListConstruct/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="116,123">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="__module.text_model.encoder.layers.0.self_attn/aten::view/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="117">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="__module.text_model.encoder.layers.0.self_attn/aten::transpose/ScatterElementsUpdate_1" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="38750367" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="__module.text_model.encoder.layers.0.self_attn/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="118">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="__module.text_model.encoder.layers.0.self_attn/aten::view/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="138,key_states.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="__module.text_model.encoder.layers.0.self_attn/aten::bmm/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="143,attn_weights.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="__module.text_model.encoder.layers.0.self_attn/aten::size/ShapeOf_2" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_52591" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38093576" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="__module.text_model.encoder.layers.0.self_attn/aten::size/Constant_2" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="38093584" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="106" name="__module.text_model.encoder.layers.0.self_attn/aten::size/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="141">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="__module.text_model.encoder.layers.0.self_attn/prim::ListConstruct/Concat_4" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="144">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="__module.text_model.encoder.layers.0.self_attn/aten::view/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="145">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="__module.text_model/aten::arange/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="38093584" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="110" name="22" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="39344047" size="4" />
			<output>
				<port id="0" precision="FP32" names="22" />
			</output>
		</layer>
		<layer id="111" name="__module.text_model/prim::ListConstruct/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="50">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="__module.text_model/aten::full/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="51_1">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="__module.text_model/aten::size/ShapeOf_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="26" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="38093568" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="26" />
			</output>
		</layer>
		<layer id="115" name="__module.text_model/aten::size/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="38093584" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="116" name="__module.text_model/aten::size/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="52,55" />
			</output>
		</layer>
		<layer id="117" name="__module.text_model/aten::arange/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="39344051" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="118" name="__module.text_model/aten::arange/Range" type="Range" version="opset4">
			<data output_type="f32" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="__module.text_model/aten::arange/ConvertLike" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="53,mask_cond">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Constant_57372" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38093576" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="__module.text_model/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="54">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Constant_35349" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38093568" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="__module.text_model/prim::ListConstruct/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="__module.text_model/prim::ListConstruct/Reshape_0_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="38093576" size="8" />
			<rt_info>
