<?xml version="1.0"?>
<net name="Model9" version="11">
	<layers>
		<layer id="3" name="attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="position_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="position_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="inputs_embeds" type="Parameter" version="opset1">
			<data shape="?,?,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="inputs_embeds">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="beam_idx" type="Parameter" version="opset1">
			<data shape="?" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="beam_idx">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_234578" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="5" name="ShapeOf_234564" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_234566" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_234568" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="8" name="Gather_234569" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_234571" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_234573" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_234575" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="20" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Concat_234576" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Broadcast_234579" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>0</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="ReadValue_229777" type="ReadValue" version="opset6">
			<data variable_id="past_key_values.9.valuepresent.9.value" variable_type="f32" variable_shape="?,32,?,128" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>0</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="past_key_values.9.value">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_224732" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="16" name="Gather_224733" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_208680" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 4096" offset="28" size="16384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_208562" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 4096" offset="16412" size="16384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_208561" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="32796" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_208559" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="32800" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="__module.model.layers.0.input_layernorm/aten::pow/Power" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="393">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_60518" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32804" size="8" />
			<output>
				<port id="0" precision="I64" names="394">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="__module.model.layers.0.input_layernorm/aten::mean/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="395,variance.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_208560" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="32812" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="__module.model.layers.0.input_layernorm/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="396">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="__module.model.layers.0.input_layernorm/aten::rsqrt/Sqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="__module.model.layers.0.input_layernorm/aten::rsqrt/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="397">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="__module.model.layers.0.input_layernorm/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="398,399,hidden_states.3,hidden_states.5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="__module.model.layers.0.input_layernorm/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4096</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="400,402,hidden_states.7">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="self.model.layers.0.self_attn.q_proj.weight" type="Const" version="opset1">
			<data element_type="u4" shape="4096, 32, 128" offset="32816" size="8388608" />
			<output>
				<port id="0" precision="U4">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Convert_241469" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U4">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="self.model.layers.0.self_attn.q_proj.weight/zero_point" type="Const" version="opset1">
			<data element_type="u4" shape="4096, 32, 1" offset="8421424" size="65536" />
			<output>
				<port id="0" precision="U4">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Convert_241471" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U4">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="self.model.layers.0.self_attn.q_proj.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="self.model.layers.0.self_attn.q_proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="4096, 32, 1" offset="8486960" size="262144" />
			<output>
				<port id="0" precision="FP16">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="self.model.layers.0.self_attn.q_proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_241476" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="8749104" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Reshape_241477" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP16">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4096</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="self.model.layers.0.self_attn.q_proj.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>4096</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4096</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="__module.model.layers.0.self_attn.q_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4096</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_208563" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 4096" offset="8749120" size="16384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="__module.model.layers.0.self_attn.q_proj/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="412,query_states.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_214863" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8765504" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="__module.model.layers.0.self_attn/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="420">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="__module.model.layers.0.self_attn/aten::transpose/ScatterElementsUpdate" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="8765536" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="__module.model.layers.0.self_attn/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="421,q.1">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="__module.model.rotary_emb/aten::to/Convert" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1" offset="8765552" size="256" />
			<output>
				<port id="0" precision="FP32" names="364">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="ShapeOf_212422" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_212423" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_212424" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="51" name="Gather_212425" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="365">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_199151" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8765808" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_199153" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8765808" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="__module.model.rotary_emb/prim::ListConstruct/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="366">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="__module.model.rotary_emb/aten::expand/Broadcast" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="367,372,inv_freq_expanded,inv_freq_expanded.1">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="242" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8765808" size="8" />
			<output>
				<port id="0" precision="I64" names="242" />
			</output>
		</layer>
		<layer id="57" name="__module.model.rotary_emb/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="369,370">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="__module.model.rotary_emb/aten::to/Convert_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="371,373,position_ids_expanded,position_ids_expanded.1">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="__module.model.rotary_emb/aten::matmul/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="374">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="__module.model.rotary_emb/aten::transpose/ScatterElementsUpdate" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="8765816" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="__module.model.rotary_emb/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="375">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.model.rotary_emb/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="377,emb">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="__module.model.rotary_emb/aten::cos/Cos" type="Cos" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="378,380,382,385,cos.1,cos.3,cos.5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="__module.model.layers.0.self_attn/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="1056,1181,1306,1431,1556,1681,1806,1931,2056,2181,2306,2431,2556,2681,2806,2931,3056,3181,3306,3431,3556,3681,3806,3931,4056,4181,428,4306,556,681,806,931,cos,cos.11,cos.13,cos.15,cos.17,cos.19,cos.21,cos.23,cos.25,cos.27,cos.29,cos.31,cos.33,cos.35,cos.37,cos.39,cos.41,cos.43,cos.45,cos.47,cos.49,cos.51,cos.53,cos.55,cos.57,cos.59,cos.61,cos.63,cos.65,cos.67,cos.7,cos.9">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="__module.model.layers.0.self_attn/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="430">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="__module.model.layers.0.self_attn/aten::size/ShapeOf_3" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="233" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8765828" size="8" />
			<output>
				<port id="0" precision="I64" names="233" />
			</output>
		</layer>
		<layer id="68" name="__module.model.layers.0.self_attn/aten::size/Constant_3" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="69" name="__module.model.layers.0.self_attn/aten::size/Gather_3" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="431,436" />
			</output>
		</layer>
		<layer id="70" name="Constant_60108" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8765836" size="8" />
			<output>
				<port id="0" precision="I64" names="229" />
			</output>
		</layer>
		<layer id="71" name="__module.model.layers.0.self_attn/aten::floor_divide/Divide_1" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" />
			</output>
		</layer>
		<layer id="72" name="__module.model.layers.0.self_attn/aten::floor_divide/Floor_1" type="Floor" version="opset1">
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="433,434,438,439" />
			</output>
		</layer>
		<layer id="73" name="Constant_171893" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32804" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="__module.model.layers.0.self_attn/aten::slice/Reshape_5" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.model.layers.0.self_attn/aten::slice/Reshape_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8765844" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.model.layers.0.self_attn/aten::slice/Reshape_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8765808" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="__module.model.layers.0.self_attn/aten::slice/Reshape_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8765828" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="__module.model.layers.0.self_attn/aten::slice/Slice" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="440,x2.1">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_208564" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="8765852" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="__module.model.layers.0.self_attn/aten::neg/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="441">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="__module.model.layers.0.self_attn/aten::slice/Reshape_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="__module.model.layers.0.self_attn/aten::slice/Reshape_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8765808" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="__module.model.layers.0.self_attn/aten::slice/Reshape_7" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8765828" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="__module.model.layers.0.self_attn/aten::slice/Slice_1" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="435">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="__module.model.layers.0.self_attn/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="443">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="__module.model.rotary_emb/aten::sin/Sin" type="Sin" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="379,381,383,386,sin.1,sin.3,sin.5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="__module.model.layers.0.self_attn/aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="1057,1182,1307,1432,1557,1682,1807,1932,2057,2182,2307,2432,2557,2682,2807,2932,3057,3182,3307,3432,3557,3682,3807,3932,4057,4182,429,4307,557,682,807,932,sin,sin.11,sin.13,sin.15,sin.17,sin.19,sin.21,sin.23,sin.25,sin.27,sin.29,sin.31,sin.33,sin.35,sin.37,sin.39,sin.41,sin.43,sin.45,sin.47,sin.49,sin.51,sin.53,sin.55,sin.57,sin.59,sin.61,sin.63,sin.65,sin.67,sin.7,sin.9">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="__module.model.layers.0.self_attn/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="444">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="__module.model.layers.0.self_attn/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="445">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_234591" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="91" name="Constant_234584" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_234586" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_234588" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="20" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Concat_234589" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Broadcast_234592" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>0</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="ReadValue_229651" type="ReadValue" version="opset6">
			<data variable_id="past_key_values.0.keypresent.0.key" variable_type="f32" variable_shape="?,32,?,128" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>0</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="past_key_values.0.key">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_224675" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="98" name="Gather_224676" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="self.model.layers.0.self_attn.k_proj.weight" type="Const" version="opset1">
			<data element_type="u4" shape="4096, 32, 128" offset="8765856" size="8388608" />
			<output>
				<port id="0" precision="U4">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Convert_241447" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U4">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="self.model.layers.0.self_attn.k_proj.weight/zero_point" type="Const" version="opset1">
			<data element_type="u4" shape="4096, 32, 1" offset="17154464" size="65536" />
			<output>
				<port id="0" precision="U4">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Convert_241449" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U4">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="self.model.layers.0.self_attn.k_proj.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="self.model.layers.0.self_attn.k_proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="4096, 32, 1" offset="17220000" size="262144" />
			<output>
				<port id="0" precision="FP16">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="self.model.layers.0.self_attn.k_proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_241454" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="8749104" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Reshape_241455" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP16">
					<dim>4096</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4096</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="self.model.layers.0.self_attn.k_proj.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>4096</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4096</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="__module.model.layers.0.self_attn.k_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4096</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_208565" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 4096" offset="17482144" size="16384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="__module.model.layers.0.self_attn.k_proj/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="415,key_states.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_214864" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8765504" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="__module.model.layers.0.self_attn/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="423">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="__module.model.layers.0.self_attn/aten::transpose/ScatterElementsUpdate_1" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="8765536" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="__module.model.layers.0.self_attn/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="424,k.1">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="__module.model.layers.0.self_attn/aten::mul/Multiply_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="446">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="__module.model.layers.0.self_attn/aten::size/ShapeOf_5" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="__module.model.layers.0.self_attn/aten::size/Constant_5" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="119" name="__module.model.layers.0.self_attn/aten::size/Gather_5" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="447,452" />
			</output>
		</layer>
		<layer id="120" name="__module.model.layers.0.self_attn/aten::floor_divide/Divide_3" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" />
			</output>
		</layer>
		<layer id="121" name="__module.model.layers.0.self_attn/aten::floor_divide/Floor_3" type="Floor" version="opset1">
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="449,450,454,455" />
			</output>
		</layer>
		<layer id="122" name="Constant_171894" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32804" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="__module.model.layers.0.self_attn/aten::slice/Reshape_13" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="__module.model.layers.0.self_attn/aten::slice/Reshape_9" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8765844" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="__module.model.layers.0.self_attn/aten::slice/Reshape_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8765808" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="__module.model.layers.0.self_attn/aten::slice/Reshape_11" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8765828" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="__module.model.layers.0.self_attn/aten::slice/Slice_2" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="456,x2.3">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Constant_208566" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="8765852" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="__module.model.layers.0.self_attn/aten::neg/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="457">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="__module.model.layers.0.self_attn/aten::slice/Reshape_12" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="__module.model.layers.0.self_attn/aten::slice/Reshape_14" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8765808" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
